package main

import "fmt"

func main() {

	//词法 操作符
	opreator_test()
}

//操作符
func opreator_test() {
	// 只列举额不常用的
	fmt.Println("--------- % 求余       ---------")

	fmt.Println("90 % 37 = ", 90%37)

	fmt.Println("--------- << >> 位移   ---------")
	fmt.Println(" 10 << 1 =", 10<<1, "  10 >> 1 = ", 10>>1)

	fmt.Println("--------- |  按位取或  ---------")
	fmt.Println("--------- &  按位取与  ---------")
	fmt.Println("--------- ^  按位取反  ---------")
	fmt.Println("--------- &^ 按位清除  ---------")
	fmt.Println("--------- 7  00000111 ---------")
	fmt.Println("--------- 13 00001101 ---------")
	fmt.Println("--------- 15 00001111 ---------")
	fmt.Println("--------- 5  00000101 ---------")
	fmt.Println("--------- 10 00001010 ---------")
	fmt.Println("--------- 2  00000010 ---------")
	fmt.Println(" 7 | 13 =", 7|13, "  7 & 13 =", 7&13, "  7 &^ 13 =", 7&^13, "  7 ^ 13 =", 7^13)

}
